// pages/must/must.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    must: [
      "1、监考人员应佩带监考证（由各单位制作）事先做好相关准备工作，必须在考试前15分钟到达考场。 ",
      " 2、开考前5分钟主监考向学生宣布考场规则，负责检查、核对学生的考试证；副监考指挥学生将与考试无关用品放在指定位置，组织学生按照考场规则就座，要求学生将“考试证”摆放在座位的右上方。",
      " 3、考生必须按照指定的位置就坐，发放试卷前监考人员要清点考场人数，学生未按指定座位就座，不得发放试卷。 ",
      " 4、监考人员要面对学生拆封试卷袋，分发试卷后，提醒学生及时检查试卷质量，如发现缺页、漏印或印刷字迹不清，应及时给予调换，考试开始后再发现试卷有误，责任由学生本人负责。 ",
      " 5、提醒学生答题时，不要将答案写在密封线外。 ",
      "  6、考试正式开始30分钟及考试结束前15分钟内，不允许学生离开考场。考试时间到，主监考宣布考试结束，学生全部起立停止答题，监考人员收缴并清点试卷份数是否与考试人数相符，无误后才允许学生离开考场，否则，其责任由监考人员自负。 ",
      "  7、考试结束后，监考人员填写监考记录单，然后到学生所在院（系）设立的试卷密封地点密封试卷、填写试卷密封面内容，最后将密封后的试卷送交开课院（系）专人保管。 ",
      "  8、监考人员要认真履行监考职责，主副监考要相互配合交替巡视，不得在考场内看书看报，不得无故离开考场，发现有违纪行为要及时制止。发现考试作弊者，要立即取消其考试资格，收缴并保存作弊物证，令其离开考场，并在试卷上注明作弊字样，将作弊学生的院系、专业、年级、学号、姓名及作弊情况等如实写入“考场记录单”，考试结束立即将“考场记录单”及物证交教务处。 "
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})